# Сводные таблицы

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({'date': ['2021-01-01', '2021-01-01', '2021-01-01', '2021-01-02', '2021-01-02'], 
                   'category': ['Авто', 'Дача', 'Дача', 'Авто', 'Дача'],
                   'cost': [100, 200, 300, 400, 500]})
df

         date category  cost
0  2021-01-01     Авто   100
1  2021-01-01     Дача   200
2  2021-01-01     Дача   300
3  2021-01-02     Авто   400
4  2021-01-02     Дача   500

In [9]:
result = df.groupby('date').agg({'category': 'count', 'cost': ['min', 'max']})
result

           category cost
              count  min  max
date
2021-01-01        3  100  300
2021-01-02        2  400  500

In [11]:
result['cost']['min']

date
2021-01-01    100
2021-01-02    400
Name: min, dtype: int64

In [7]:
df.groupby('date').agg(['sum', 'count'])

                category       cost
                     sum count  sum count
date
2021-01-01  АвтоДачаДача     3  600     3
2021-01-02      АвтоДача     2  900     2

In [5]:
df.groupby('date').sum().reset_index()

         date  cost
0  2021-01-01   600
1  2021-01-02   900

In [6]:
df.groupby(['date', 'category']).sum().reset_index()

         date category  cost
0  2021-01-01     Авто   100
1  2021-01-01     Дача   500
2  2021-01-02     Авто   400
3  2021-01-02     Дача   500

In [13]:
df['category'].unique()

array(['Авто', 'Дача'], dtype=object)

In [14]:
df[(df['date'] == '2021-01-01') & (df['category'] == 'Дача')]

         date category  cost
1  2021-01-01     Дача   200
2  2021-01-01     Дача   300

In [17]:
df[(df['date'] == '2021-01-01') & (df['category'] == 'Дача')]['cost']

1    200
2    300
Name: cost, dtype: int64

In [19]:
df.pivot_table(index='date', columns='category', values='cost', aggfunc='sum')

category    Авто  Дача
date
2021-01-01   100   500
2021-01-02   400   500

In [ ]:
df_pivot = df.pivot_table(index='date', columns='category', values='cost', 
                          aggfunc='sum', margins=True)
df_pivot.reset_index()

In [20]:
df[(df['date'] == '2021-01-01') & (df['category'] == 'Дача')]['cost']

1    200
2    300
Name: cost, dtype: int64

In [21]:
def pivot_range(cost):
    return cost.max() - cost.min()

In [22]:
df.pivot_table(index='date', columns='category', values='cost', aggfunc=pivot_range)

category    Авто  Дача
date
2021-01-01     0   100
2021-01-02     0     0

# Задача про LEFT JOIN
- Есть таблица left_table из 100 строк
- Объединяем ее с right_table
- Сколько строк может быть на выходе?

In [23]:
import pandas as pd

In [24]:
left_table = pd.DataFrame({'date': ['2021-01-01'], 'value': [100]})
left_table

         date  value
0  2021-01-01    100

In [28]:
right_table = pd.DataFrame({'date': ['2021-01-01', '2021-01-02', '2021-01-01'], 
                            'value_right': [200, 300, 500]})
right_table

         date  value_right
0  2021-01-01          200
1  2021-01-02          300
2  2021-01-01          500

In [29]:
left_table.merge(right_table, on='date', how='left')

         date  value  value_right
0  2021-01-01    100          200
1  2021-01-01    100          500

In [27]:
left_table.merge(right_table, on='date', how='right')

         date  value  value_right
0  2021-01-01  100.0          200
1  2021-01-02    NaN          300

### Пример посложнее

In [30]:
left_table = pd.DataFrame({'date': ['2021-01-01', '2021-01-01'], 'value': [100, 150]})
left_table

         date  value
0  2021-01-01    100
1  2021-01-01    150

In [31]:
right_table = pd.DataFrame({'date': ['2021-01-01', '2021-01-01'], 'value_right': [200, 400]})
right_table

         date  value_right
0  2021-01-01          200
1  2021-01-01          400

In [32]:
left_table.merge(right_table, on='date', how='left')

         date  value  value_right
0  2021-01-01    100          200
1  2021-01-01    100          400
2  2021-01-01    150          200
3  2021-01-01    150          400

In [34]:
1000000**2

1000000000000

In [ ]:
right_table

In [35]:
# полные дубликаты строк

right_table[right_table.duplicated()]

Empty DataFrame
Columns: [date, value_right]
Index: []

In [38]:
# дубликаты по столбцу (набору столбцов)

right_table[right_table.duplicated(['date'])]

         date  value_right
1  2021-01-01          400

### CROSS JOIN
Каждый с каждым

In [39]:
df_names = pd.DataFrame({'names': ['Лена', 'Настя', 'Витя']})
df_names

   names
0   Лена
1  Настя
2   Витя

In [40]:
df_dates = pd.DataFrame({'names': ['2021-01-01', '2021-01-02', '2021-01-03']})
df_dates

        names
0  2021-01-01
1  2021-01-02
2  2021-01-03

In [41]:
df_names['fake'] = True
df_names

   names  fake
0   Лена  True
1  Настя  True
2   Витя  True

In [42]:
df_dates['fake'] = True
df_dates

        names  fake
0  2021-01-01  True
1  2021-01-02  True
2  2021-01-03  True

In [43]:
df_names.merge(df_dates, on='fake', how='left', suffixes=['_names', '_dates'])

  names_names  fake names_dates
0        Лена  True  2021-01-01
1        Лена  True  2021-01-02
2        Лена  True  2021-01-03
3       Настя  True  2021-01-01
4       Настя  True  2021-01-02
5       Настя  True  2021-01-03
6        Витя  True  2021-01-01
7        Витя  True  2021-01-02
8        Витя  True  2021-01-03

# Задачка с собеседований
Для каждого номера счета и даты посчитать разницу доходов и расходов

In [44]:
import pandas as pd
import sqlite3

In [45]:
con = sqlite3.connect('finance.db')
con

In [46]:
credit = pd.read_sql("""
    select date, account, value from credit
    """, con)
credit

         date  account  value
0  2021-01-01      111     50
1  2021-01-01      222    100
2  2021-01-01      111     55
3  2021-01-02      111     45

In [47]:
debit = pd.read_sql("""
    select date, account, value from debit
    """, con)
debit

         date  account  value
0  2021-01-01      111    100
1  2021-01-01      222    200
2  2021-01-01      111    110
3  2021-01-02      111     90
4  2021-01-03      111     90

### Ошибочное объединение

In [48]:
credit.merge(debit, on=['date', 'account'], how='outer')

         date  account  value_x  value_y
0  2021-01-01      111     50.0      100
1  2021-01-01      111     50.0      110
2  2021-01-01      111     55.0      100
3  2021-01-01      111     55.0      110
4  2021-01-01      222    100.0      200
5  2021-01-02      111     45.0       90
6  2021-01-03      111      NaN       90

In [ ]:
pd.read_sql("""
    select d.date, d.account, d.value, c.value from debit d
    left outer join credit c
    on d.date=c.date and d.account = c.account
    """, con)

### Добавляем группировку

In [50]:
debit_grouped = debit.groupby(['date', 'account']).sum().reset_index()
debit_grouped

         date  account  value
0  2021-01-01      111    210
1  2021-01-01      222    200
2  2021-01-02      111     90
3  2021-01-03      111     90

In [51]:
credit_grouped = credit.groupby(['date', 'account']).sum().reset_index()
credit_grouped

         date  account  value
0  2021-01-01      111    105
1  2021-01-01      222    100
2  2021-01-02      111     45

In [ ]:
pd.read_sql("""
    select d.date, d.account, d.value from (
        select date, account, sum(value) as value
        from debit
        group by date, account
    ) d
    """, con)

In [ ]:
pd.read_sql("""
    select c.date, c.account, c.value from (
        select date, account, sum(value) as value
        from credit
        group by date, account
    ) c
    """, con)

### И только после группировки объединяем

In [53]:
credit_grouped.merge(debit_grouped, on=['date', 'account'], how='outer', 
                     suffixes=['_credit', '_debit'])

         date  account  value_credit  value_debit
0  2021-01-01      111         105.0          210
1  2021-01-01      222         100.0          200
2  2021-01-02      111          45.0           90
3  2021-01-03      111           NaN           90

In [ ]:
pd.read_sql("""
    select d.date, d.account, d.value from (
        select date, account, sum(value) as value
        from debit
        group by date, account
    ) d
    
    left outer join
    
    (select c.date, c.account, c.value from (
        select date, account, sum(value) as value
        from credit
        group by date, account
    ) c) c_2
    
    on d.date=c_2.date and d.account=c_2.account
    """, con)

### Вариант получше через UNION

In [55]:
100 + (-200)

-100

In [57]:
credit['value'] = -credit['value']
credit

         date  account  value
0  2021-01-01      111    -50
1  2021-01-01      222   -100
2  2021-01-01      111    -55
3  2021-01-02      111    -45

In [59]:
pd.concat([debit, credit]).groupby(['date', 'account']).sum()

                    value
date       account
2021-01-01 111        105
           222        100
2021-01-02 111         45
2021-01-03 111         90

In [ ]:
pd.read_sql("""
    select date, account, value
    from debit
    
    union all
    
    select date, account, -value
    from credit
    """, con)

In [60]:
pd.read_sql(""" 
    select date, account, sum(value) from (
        select date, account, value
        from debit

        union all

        select date, account, -value
        from credit
    )
    group by date, account
    """, con)

         date  account  sum(value)
0  2021-01-01      111         105
1  2021-01-01      222         100
2  2021-01-02      111          45
3  2021-01-03      111          90

In [ ]:
con.close()

# Простая база данных

Запись датафрейма в базу данных

In [61]:
import pandas as pd
import sqlite3

In [62]:
df = pd.read_csv('keywords.csv')
df.head()

         keyword     shows
0             вк  64292779
1  одноклассники  63810309
2          порно  41747114
3           ютуб  39995567
4      вконтакте  21014195

In [63]:
con = sqlite3.connect('keywords.db')

In [ ]:
import pymysql

con = pymysql.connect(host, port, user, password, db)

In [ ]:
import psycorpg2

con = psycorpg2.connect(host, port, user, password, db)

In [64]:
?df.to_sql

In [65]:
df.to_sql('keywords', con, if_exists='replace')

In [66]:
con.close()

Чтение из базы

In [67]:
con = sqlite3.connect('keywords.db')

In [68]:
pd.read_sql('select * from keywords limit 5', con)

   index        keyword     shows
0      0             вк  64292779
1      1  одноклассники  63810309
2      2          порно  41747114
3      3           ютуб  39995567
4      4      вконтакте  21014195

In [69]:
df_sql = pd.read_sql('select * from keywords where keyword like "%вконтакте%";', con)
df_sql

    index                               keyword     shows
0       4                             вконтакте  21014195
1      14                вконтакте моя страница   5971451
2     317            вконтакте вход на страницу    488442
3     530                моя страница вконтакте   5971451
4     896             вконтакте социальная сеть    202480
..    ...                                   ...       ...
84  96819             оренбург онлайн вконтакте      3894
85  97029           раскрутка групп в вконтакте      3782
86  98809                весь арзамас вконтакте      3623
87  99696  моя страница вконтакте одноклассники     16548
88  99703                          вк вконтакте      4766

[89 rows x 3 columns]

Построчная обработка

In [70]:
cur = con.cursor()  # в MySQL есть разные типы курсоров (типа SSDictCursor)

In [71]:
cur.execute('select * from keywords where keyword like "%вконтакте%";')

In [ ]:
f = open('...')
f.readline()

In [72]:
line = cur.fetchone()  # fetchall() fetchmany()
line

(4, 'вконтакте', 21014195)

In [ ]:
another_line = cur.fetchone()
another_line

In [73]:
for i, line in enumerate(cur.execute('select * from keywords where keyword like "%вконтакте%";')):
    print(i, line)
    
    if i > 5:
        break

0 (4, 'вконтакте', 21014195)
1 (14, 'вконтакте моя страница', 5971451)
2 (317, 'вконтакте вход на страницу', 488442)
3 (530, 'моя страница вконтакте', 5971451)
4 (896, 'вконтакте социальная сеть', 202480)
5 (1003, 'вконтакте вход', 190587)
6 (1093, 'вконтакте моя', 173001)

# Два совета дня
- Попросите админов для аналитики сделать вам реплику базы
- Тяжелые SQL-запросы лучше обрабатывать на сервере, где живет база